# GetBoundaryPoints Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TopographySurface..::..GetBoundaryPoints Method
TopographySurface Class See Also
---
Gets the points which are on the boundary of the topography surface.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public IList<XYZ> GetBoundaryPoints()
```

Visual Basic
---
```text
Public Function GetBoundaryPoints As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetBoundaryPoints()
```

# ### Return Value
The collection of boundary points.
# Remarks
This applies to TopographySurface, SiteSubRegion, and the topography surface associated with a BuildingPad element. For a SiteSubRegion, this returns the points from a representation of the region's boundary. For the topography surface associated with a BuildingPad element, this returns the points from the sketch of this topography surface.
# See Also
TopographySurface Class
Autodesk.Revit.DB.Architecture Namespace